%% h(x) : nonlinear measurement eqn
function y = EKF1_fn_hx(x)
%% For LC62-50B
%======================================================
m = 41.97;    % kg

p = x(1);
q = x(2);
r = x(3);
w = x(4:9);

% Thrust-PWM relatioinship
K = 9.81/1000;                                                  % 단위([g] -> [N])와 PWM 0~1 사이로 정규화하기위해 곱해진 텀
a = -19281; b = 36503; c = -992.75;               % 추력 테스트 결과 방정식의 계수

T1 = K*(a*w(1)^3 + b*w(1)^2 + c*w(1));
T2 = K*(a*w(2)^3 + b*w(2)^2 + c*w(2));
T3 = K*(a*w(3)^3 + b*w(3)^2 + c*w(3));
T4 = K*(a*w(4)^3 + b*w(4)^2 + c*w(4));
T5 = K*(a*w(5)^3 + b*w(5)^2 + c*w(5));
T6 = K*(a*w(6)^3 + b*w(6)^2 + c*w(6));

y = zeros(4,1);
y(1) = 1*p;
y(2) = 1*q;
y(3) = 1*r;
y(4) = (1/m)*(T1+T2+T3+T4+T5+T6);
%======================================================
end