%% partial_f/partial_X : Jacobian of system eqn
function H = EKF1_fn_JH(x)
%% For LC62-50B
%======================================================
m = 41.97;          % kg
w = x(4:9);

% 추력방정식 미분식
K = 9.81/1000;                                                  % 단위([g] -> [N])와 PWM 0~1 사이로 정규화하기위해 곱해진 텀
a = -19281; b = 36503; c = -992.75;               % 추력 테스트 결과 방정식의 계수

dTdw1 = K*( 3*a*w(1)^2 + 2*b*w(1) + c );
dTdw2 = K*( 3*a*w(2)^2 + 2*b*w(2) + c );
dTdw3 = K*( 3*a*w(3)^2 + 2*b*w(3) + c );
dTdw4 = K*( 3*a*w(4)^2 + 2*b*w(4) + c );
dTdw5 = K*( 3*a*w(5)^2 + 2*b*w(5) + c );
dTdw6 = K*( 3*a*w(6)^2 + 2*b*w(6) + c );

H = zeros(4,9);
H(1,1) = 1;
H(2,2) = 1;
H(3,3) = 1;

H(4,1) = 0;
H(4,2) = 0;
H(4,3) = 0;
H(4,4) = (1/m)*(dTdw1);
H(4,5) = (1/m)*(dTdw2);
H(4,6) = (1/m)*(dTdw3);
H(4,7) = (1/m)*(dTdw4);
H(4,8) = (1/m)*(dTdw5);
H(4,9) = (1/m)*(dTdw6);
%======================================================